{"index":{"slug":"index","filePath":"index.md","title":"Welcome to Quartz","links":[],"tags":[],"content":"This is a blank Quartz installation.\nSee the documentation for how to get started."},"技术措施":{"slug":"技术措施","filePath":"技术措施.md","title":"技术措施","links":[],"tags":[],"content":"数据接口安全\n防护措施\n1. 身份鉴别\n目标：验证调用方的身份合法性。\n实现：\n\nAPI密钥：服务器生成一个唯一的API Key，分配给用户/应用；客户端每次调用API时，在请求头或参数中提供API Key。\nOAuth 2.0：通过授权服务器颁发访问令牌Access Token。\nJWT：基于令牌的身份验证，支持携带用户角色和权限。\n多因素认证与证书\n\n2. 访问控制\n目标：限制接口的访问范围。\n实现：\n\nIP白名单：仅允许特定 IP 或网段访问敏感接口。\nRBAC（基于角色的访问控制）：根据用户角色限制接口权限。\nABAC（基于属性的访问控制）：通过用户属性、资源属性和环境因素（如时间、地点、设备）进行动态访问控制。\n\n3. 授权策略\n目标：动态授予最小必要权限。\n实现：\n\nOAuth2 Scope 机制：通过Scope控制令牌的权限，如read:profile、write:posts。\nACL（访问控制列表）：指定哪些用户/应用能访问特定资源。\n\n4. 接口签名\n目标：防止请求被篡改或重放攻击。\n实现：\n\nHMAC-SH256（基于哈希的消息认证码）：服务器和客户端共享一个密钥，用于生成请求签名。\n\nimport hashlib\nimport hmac\nimport base64\nimport time\n \nAPI_SECRET = &quot;your_secret_key&quot;\ndata = &quot;GET/v1/data?timestamp=1675032025&quot;\n \nsignature = base64.b64encode(hmac.new(API_SECRET.encode(), data.encode(), hashlib.sha256).digest()).decode()\n\nRSA（非对称签名）：客户端使用私钥对请求签名，服务器用公钥验证。\n时间戳防重放：请求中携带时间戳，服务端校验时间窗口（如 ±5 分钟）。\n\n5. 安全传输协议\n目标：防止数据在传输过程中被窃听或篡改。\n实现：\n\nHTTPS/TLS 加密：强制所有API请求使用HTTPS，防止中间人攻击。\nmTLS（双向TLS）：客户端和服务器都使用证书进行身份验证。\n\n网络安全\n网络类型\n专线网络\n定义：专线网络是指企业或机构向运营商租用的专用通信线路，用于实现高质量的网络连接。它可以连接企业的总部、分支机构、数据中心等，提供稳定、高速、安全的网络服务。\n特点：\n\n独占带宽：企业拥有独立的物理或逻辑专线，不受公网流量影响。\n高安全性：数据不经过公共互联网，降低了被攻击或窃听的风险。\n低延迟、高稳定性：适用于高并发、低延迟的应用场景（如金融交易、远程医疗、视频会议）。\n高成本：需要租用运营商提供的专线，费用比 VPN 高。\n强调网络架构的专用性和物理隔离。\n\nVPN\n定义：是一种在公共网络（如互联网）上创建安全加密隧道，实现远程访问或分支机构互联的技术。它允许用户在不租用专线的情况下，实现类似专线的安全通信。\n特点：\n\n成本较低：无需租用物理专线，仅需 VPN 服务器和客户端即可使用。\n安全性较高：通过加密隧道技术保护数据，防止窃听和篡改。\n灵活性强：支持远程办公、跨国访问、分支机构互联。\n依赖公网质量：数据传输受互联网波动影响，稳定性较专线差。\n强调在公共网络上构建虚拟专用网络，提供安全通信。\n\n网络区域（chatgpt）\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n经典网络区域安全等级划分功能用途互联网区低安全互联网访问DMZ区（隔离区/非军事区）半信任对外服务，如Web服务器、DNS服务器、邮件服务器、数据库服务器办公网受信任员工日常办公网络研发区受信任用于开发、测试、模拟环境，不同于生产环境生产区高安全业务关键系统运行区域存储区域网络（SAN）高安全用于数据存储和备份，支持高速数据传输运维管理区高安全设备管理、堡垒机、日志审计、监控系统工控网络极高安全适用于电网、制造、交通的工业控制系统\n网络安全设备\n网闸（安全隔离网关）\n定义：是一种物理或逻辑设备，用于在两个网络之间实现单向数据传输，确保数据只能从一个方向流动，而不能反向传输。它通常用于高安全需求的环境中，如政府、军事和关键基础设施。\n特点：\n\n物理隔离或逻辑隔离，高安全性\n单向或双向数据传输控制，确保信息可控流通\n协议转换，如文件、数据库、邮件等数据安全交换\n无法直接访问隔离网络，防止病毒、黑客入侵\n适用场景：\n高安全等级网络隔离（物理隔离 / 逻辑隔离）\n数据单向传输 / 受控双向传输\n防止外部攻击和数据泄露\n\n防火墙\n定义：是一种网络安全系统，通过监控和控制进出网络流量，根据预定的安全规则来阻止未经授权的访问。它充当网络边界的第一道防线，保护内部网络免受外部威胁。\n特点：\n\n基于规则的访问控制，如 IP、端口、协议过滤\n支持状态检测（SPI），可以识别并管理网络连接状态\n可集成入侵防御系统（IPS/IDS），检测恶意流量\n分为软件防火墙和硬件防火墙。\n适用场景：\n企业网络边界防护\n访问控制，阻止未经授权的流量\n防止网络攻击（如 DDoS、SQL 注入、木马入侵）\n\n堡垒机\n定义：是一种专门设计用于提供集中化访问控制和审计功能的服务器或设备。它通常位于网络的最前沿，作为外部访问的第一道防线，确保只有经过授权的用户和流量能够进入内部网络。\n特点：\n\n集中身份认证（多因素认证），防止账户滥用。\n访问控制，精细化管理不同用户对服务器、网络设备的权限\n操作审计，完整记录所有运维操作（屏幕录制、命令审计）\n支持 SSH、RDP、Telnet、数据库管理等远程运维协议\n适用场景：\n运维安全管理（身份认证 + 权限管理 + 操作审计）\n防止内部人员滥用权限或误操作\n满足合规性要求（如金融、医疗、政府法规）\n\n数据采集活动\n数据采集（chatgpt）\n定义\n指通过多种手段和途径从不同的数据源获取所需数据的过程。这一过程的核心目标是确保获得与特定业务需求相关的、合法合规的数据。\n常见场景\n\n从原始数据源获取数据：例如，通过传感器、设备、日志、用户输入等渠道采集未经处理的原始数据。此类数据通常需要进一步处理、清洗和转换才能用于分析或其他业务需求。\n获取结构化和非结构化数据：数据采集不仅限于传统的结构化数据（如数据库中的表格数据），还包括非结构化数据（如文本、图片、视频等）和半结构化数据（如JSON、XML等）。\n从外部数据源获取数据：通过API接口、网络爬虫或与第三方合作获取的数据，通常是公开的或授权的数据。采集此类数据时需要特别注意合规性要求，如获得适当的授权、确保数据隐私等。\n实时数据的采集：例如，通过物联网（IoT）设备或实时监控系统获取的数据，这类数据通常用于及时的分析和决策。\n经过初步处理的数据采集：尽管数据采集通常是获取原始数据，但在某些情况下，也可能采集已经进行初步处理或清洗的数据，这些数据可能来自其他系统或数据仓库。\n\n数据提供活动\n数据转移（chatgpt）\n定义\n指数据从一个位置、系统或网络节点移动到另一个位置、系统或节点的过程。\n风险点\n\n传输过程中数据的保密性：未加密数据可能被截取。\n完整性风险：数据可能在传输中被篡改，导致数据质量下降或产生错误信息。\n可用性风险：数据在转移中丢失、损坏或未能成功恢复，影响业务连续性。\n\n常见场景\n\n内部数据共享与转移。\n\n在企业或组织内部，不同业务部门之间共享数据。例如，销售部门将客户信息共享给财务部门。\n\n\n外部数据传输\n\n将数据提供给外部服务商或合作伙伴，例如将客户信息传输到外部支付平台或分析工具。\n\n\n跨境数据转移\n\n数据在不同国家的系统和数据中心之间传输，常见于跨国公司的运营中。\n\n\n\n防护措施\n\n加密数据在传输途中的内容。\n确保传输端点的身份验证和访问控制。\n选择可靠的传输协议（如 HTTPS、SFTP、VPN 等）。\n实施数据转移过程中的详细审计和日志记录，以便事后追踪和分析潜在问题。\n\n数据存储活动\n逾期存储（chatgpt）\n定义\n指企业或组织在数据的生命周期管理过程中，未按照既定的合规要求、业务需求或数据管理策略，超出法定或内部规定的存储期限而继续保留数据的行为。逾期存储的数据可能包括个人信息、业务数据、日志、财务记录等，长期保留这些数据会带来合规性、安全性和运营成本方面的风险。\n风险\n\n合规风险\n\n违反法律法规（如《个人信息保护法》（PIPL）、《通用数据保护条例》（GDPR）、《数据安全法》等），可能导致行政处罚、法律责任或企业声誉受损。\n监管部门通常要求特定类型的数据（如财务、医疗、个人隐私数据）必须在规定的时间后销毁或匿名化。\n\n\n数据泄露风险\n\n过期数据可能包含敏感信息，随着存储时间的延长，暴露给未经授权访问的风险增大。\n旧数据存储系统可能缺乏有效的安全措施，易受黑客攻击。\n\n\n存储成本增加\n\n不必要的长期存储占用大量存储资源，增加存储和管理成本，影响企业的IT预算。\n难以高效管理，影响数据存取效率。\n\n\n数据质量下降\n\n过时数据可能导致业务决策失误，影响数据分析和洞察的准确性。\n数据冗余会降低数据治理效率，影响数据一致性。\n\n\n\n常见场景\n5. 日志数据未按规定清理\n+ 服务器、应用、系统日志长时间存储，未定期归档或删除。\n6. 备份数据长期保留\n+ 业务数据备份未按照数据生命周期策略执行定期删除，导致冗余数据积累。\n7. 客户信息未及时销毁\n+ 过期的用户注册信息、交易记录等未按照隐私政策销毁，增加泄露风险。\n8. 项目历史数据长期存储\n+ 项目完成后仍然保留大量历史文档和数据，未归档或清理。\n防护措施\n\n制定数据生命周期管理策略\n\n明确数据从创建、存储、归档到销毁的周期，设定明确的存储期限。\n\n\n实施数据分类分级管理\n\n针对不同类型的数据（如敏感数据、普通业务数据），采取不同的存储策略和保留期限。\n\n\n自动化数据清理机制\n\n采用数据存储策略，如定期自动删除、归档、匿名化，减少人工干预的可能性。\n\n\n合规审计与检查\n\n定期进行数据合规性审计，确保数据保留策略符合法律法规和行业标准。\n\n\n存储优化技术\n\n采用存储压缩、冷热数据分层管理等方式，减少存储占用，同时确保访问效率。\n\n\n\n存储方式\n非结构化\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n存储方式方式适用场景优势劣势本地存储服务器磁盘小型网站、临时文件访问快，易实现不支持多机共享，易丢失NFS/NAS共享文件存储企业文档、分布式应用服务器共享，支持权限控制受网络限制，扩展性有限对象存储（S3, OSS）云存储互联网应用、全球访问高可用，弹性扩展访问需 API，成本较高分布式存储（HDFS, FastDFS）集群文件存储大数据、CDN、AI高吞吐，支持 PB 级数据部署复杂，维护成本高\n云存储和网盘（chatgpt）\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n对比项云存储网盘定义一种基于云计算的数据存储服务，提供弹性扩展、远程访问、数据管理等功能主要用于个人或企业用户存储、同步和共享文件的在线存储服务功能高度可定制，支持块存储、对象存储、文件存储等模式，适用于大规模数据处理以文件存储和共享为主，支持多端同步存储方式提供结构化、非结构化数据存储，支持 API 接口访问主要以文件目录管理方式进行存储\n存储加密（chatgpt）\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n加密方式加密对象适用场景加密存储结果读写影响透明加密（TDE）整个数据库文件防止数据库文件泄露数据库文件加密低（自动加解密）文件级加密（FLE）数据库备份、日志保护存储数据文件加密存储低（需要手动解密）列级加密仅特定列保护敏感数据（如密码）列数据加密存储高（查询需解密）行级加密整行数据多租户、权限管理整行数据加密存储高（需要手动解密）\n其他\n数据安全特性\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n安全特性特性定义评估关注点保密性防止数据被未授权访问分类分级、访问控制、加密、权限管理、DLP、第三方接口完整性防止数据被篡改，保持一致性校验机制、日志审计、事务控制、异常处理、备份一致性可用性确保数据在需要时可访问备份恢复、容灾架构、系统监控、防DDoS、高可用性设计\n保密性指确保数据只被授权访问者访问，防止未授权访问、泄露或滥用。\n评估工作：\n\n数据分类分级：是否对数据进行分类（如敏感/非敏感）并按等级管理\n访问控制机制：是否基于身份（RBAC/ABAC）进行权限控制\n加密措施：数据在存储和传输中是否使用加密？算法是否符合标准\n最小权限原则：是否对用户/系统权限按“最小可行”原则授予\n第三方数据共享：是否控制第三方接口数据暴露范围及加密传输\n泄露检测与响应：是否部署数据防泄露（DLP）系统，是否有响应预案\n\n完整性指确保数据在存储、传输和处理过程中不被未授权篡改或损坏，并可验证其是否被篡改。\n评估工作：\n\n完整性校验机制：是否使用哈希（如SHA-256）或签名对关键数据做完整性验证\n日志管理与审计：是否记录关键数据操作日志，并具备防篡改能力\n事务一致性保障：系统在进行数据写入时是否支持事务一致性或冗余校验机制\n系统异常处理机制：是否能避免断电/系统异常导致的数据损坏\n备份一致性验证：是否对备份数据进行校验，确保一致性和可恢复\n\n可用性指在需要时数据能够被授权人员访问和使用，系统能维持持续服务不中断，确保业务连续性。\n评估工作：\n\n数据备份与恢复能力：是否定期备份关键数据？能否快速恢复\n高可用架构设计：是否部署负载均衡、冗余系统、故障转移机制等\n容灾能力：是否具备异地灾备或云灾备，满足恢复时间目标（RTO）和恢复点目标（RPO）\n抗拒绝服务能力：是否具备防DDoS、系统负载保护等机制\n关键系统监控机制：是否实时监控数据访问、系统性能和可用性\n"},"知识点":{"slug":"知识点","filePath":"知识点.md","title":"知识点","links":[],"tags":[],"content":"\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n名词定义参考合法权益数据处理环境指数据存储、处理和转换所处的物理环境，主要包括生产环境、分析环境和测试环境等。网络自动化决策通过计算机程序自动分析、评估个人的行为习惯、兴趣爱好或者经济、健康、信用状况等，并进行决策的活动。个人信息保护法身份鉴别身份鉴别是指对主客体身份进行确认的过程，也就是对网络用户在进入系统或访问受限系统资源时的身份进行识别和验证的过程。网络访问控制一种确保数据处理系统的资源只能由经授权实体以授权方式进行访问的手段。GBT+25069-2022 信息安全技术 术语"}}